test/nylon_ball_in_silicon_oil_tube/mix_impl_FD/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

convertToMeters 1;

vertices
(
  (0   0   0)
  (0.1 0   0)
  (0.1 0.1 0)
  (0   0.1 0)
  (0   0   0.16)
  (0.1 0   0.16)
  (0.1 0.1 0.16)
  (0   0.1 0.16)
);

blocks
(
  hex (0 1 2 3 4 5 6 7) (48 48 72) simpleGrading (1 1 1)
);

patches
(
  wall down
  (
    (0 3 2 1)
  )
  wall up
  (
    (4 5 6 7)
  )
  wall walls
  (
    (2 6 5 1)
    (0 4 7 3)
    (3 7 6 2)
    (1 5 4 0)
  )
);
